app/controllers/groups_controller.rb

    def index
    render json: Group.all
---
SELECT "groups".* FROM "groups"

    def show
        g = Group.find(params[:id])
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]