app/controllers/posts_controller.rb

    def index
        render json: Post.all
---
SELECT "posts".* FROM "posts"

    def create
        p = Post.create(post_params)
---
INSERT INTO "posts" ("user_id", "group_id", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["group_id", 1], ["text", "What has to be broken before you can use it?"], ["created_at", "2022-10-06 23:58:13.026924"], ["updated_at", "2022-10-06 23:58:13.026924"]]

    def update
        p = Post.find(params[:id])
        updated = p.update(:text => params[:text])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 49], ["LIMIT", 1]]
UPDATE "posts" SET "text" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["text", "What invention lets you look right through a wall?"], ["updated_at", "2022-10-07 16:52:24.098849"], ["id", 49]]